week-03-computability-and-turing-machines/slides.tex
% Created 2023-04-24 Mon 17:10
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{default}
\author{Mathematical Logic Course}
\date{\today}
\title{Week 3: Computability and Turing Machines}
\hypersetup{
 pdfauthor={Mathematical Logic Course},
 pdftitle={Week 3: Computability and Turing Machines},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:orgddc7838}]{Introduction}
\begin{itemize}
\item Welcome to Week 3 of our Mathematical Logic Course!
\item This week, we'll explore the concepts of computability and Turing machines.
\item We'll cover the following topics:
\begin{itemize}
\item Introduction to computability theory
\item Turing machines: definition and examples
\item Decidable and undecidable problems
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb6b02bf}]{Computability Theory}
\begin{itemize}
\item What does it mean for a problem to be computable?
\item Alan Turing and his contributions to computability theory
\item Formal definition of an algorithm
\item Church-Turing thesis
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org2a3370d}]{Turing Machines}
\begin{itemize}
\item What is a Turing machine?
\item Components of a Turing machine: tape, head, states, transition function
\item Formal definition of a Turing machine
\item Examples of Turing machines
\begin{itemize}
\item Turing machine for addition
\item Turing machine for recognizing palindromes
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgab12469}]{Decidability and Undecidability}
\begin{itemize}
\item Decidable problems: problems that can be solved by a Turing machine
\item Undecidable problems: problems that cannot be solved by any Turing machine
\item Examples of decidable problems
\item Examples of undecidable problems
\begin{itemize}
\item The Halting Problem
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga08a17e}]{Summary and Conclusion}
\begin{itemize}
\item Recap of the topics covered in this lecture
\item Introduction to computability and Turing machines
\item Understanding the limits of computation
\item Next week, we'll dive into Gödel numbering and representability
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org49ba3cf}]{Questions and Discussion}
\begin{itemize}
\item Do you have any questions about today's lecture?
\item Let's discuss the material and explore any questions you may have
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org62bc066}]{Coding Exercises}
\begin{itemize}
\item Implementing and simulating Turing machines in Python
\item Exploring examples of decidable and undecidable problems
\end{itemize}
\end{frame}
\end{document}